export default class WorldeWords {
    static words3 = [
        "кот", "дом", "лес", "мир", "чай",
        "сон", "мяч", "сад", "час", "шаг",
        "лук", "сыр", "мед", "лед", "пар",
        "газ", "ток", "бор", "дуб", "мак",
        "кит", "лев", "жук", "сом", "рак",
        "нож", "таз", "фен", "вал", "код"
    ];

    static words4 = [
        "небо", "море", "гора", "река", "поле",
        "хлеб", "вода", "каша", "мясо", "кофе",
        "утро", "день", "ночь", "зима", "лето",
        "слон", "волк", "тигр", "лиса", "рыба",
        "стол", "стул", "окно", "дверь", "мост",
        "игра", "кино", "цирк", "тема", "план"
    ];

    static words5 = [
        "арбуз", "банан", "ветер", "город", "дверь",
        "енот", "жизнь", "замок", "игрок", "книга",
        "лодка", "маска", "носок", "океан", "песок",
        "радио", "слово", "тигр", "улица", "факел",
        "хомяк", "центр", "чашка", "школа", "щенок",
        "экран", "юрист", "яблоко", "билет", "вечер"
    ];

    static words6 = [
        "артист", "бензин", "вокзал", "гитара", "дворец",
        "дорога", "завтрак", "здание", "золото", "камень",
        "колесо", "космос", "краска", "курица", "лестница",
        "магнит", "молоко", "остров", "память", "печень",
        "погода", "прибор", "ракета", "сердце", "собака",
        "солнце", "стекло", "страна", "улыбка", "физика"
    ];

    static getRandomWord(letters) {
        const list = WorldeWords[`words${letters}`];
        
        if (!list) return "Нет слов такой длины";

        const randomIndex = Math.floor(Math.random() * list.length);
        return list[randomIndex];
    }
}